OdGeLoopCtx.getLoopType(System.Double)
\details
Determines loop type.
\param dTol [in]  Geometric tolerance.
\returns
Loop type as a LoopType value.
\remarks
All validation input parameters (surface, edges) should be done on caller side.

OdGeLoopCtx.#ctor(OdGeSurface!System.Runtime.CompilerServices.IsConst*,OdArray&lt;std.pair&lt;OdGeCurve2d!System.Runtime.CompilerServices.IsConst**,System.Boolean&gt;,OdObjectsAllocator&lt;std.pair&lt;OdGeCurve2d!System.Runtime.CompilerServices.IsConst**,System.Boolean&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdGeCurve3d!System.Runtime.CompilerServices.IsConst**,OdObjectsAllocator&lt;OdGeCurve3d!System.Runtime.CompilerServices.IsConst**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Constructor for OdGeLoopCtx.
\param pSurface [in]  Surface.
\param arrCoedges [in]  Array of coedges, i.e. 2d curves forming the loop with reverse flags, indicating whether 2d and 3d curves have opposite orientations.
\param arrEdges [in]  Array of edges, i.e. 3d curves forming the loop.
\param bFaceReversed [in]  Is face reversed relative to the surface.